Autodesk.Revit.DB.Structure.FabricTagComponentReference
How FabricSheet tag text will be aligned to the FabricSheet symbol.

Autodesk.Revit.DB.Structure.FabricTagComponentReference.Intersection
Tag and Leader will reference the intersection of the major and minor axes.

Autodesk.Revit.DB.Structure.FabricTagComponentReference.Diagonal
Tag and Leader will reference the symbol diagonal.

Autodesk.Revit.DB.Structure.FabricTagComponentReference.MinorAxis
Tag and Leader will reference the symbol minor direction axis.

Autodesk.Revit.DB.Structure.FabricTagComponentReference.MajorAxis
Tag and Leader will reference the symbol major direction axis.